def main(x,y):
    if x > 0 and y > 0:
        print("Точка розташована в верхньому правому куті.")
    elif x < 0 and y > 0:
        print("Точка розташована в верхньому лівому куті.")
    elif x < 0 and y < 0:
        print("Точка розташована в нижньому лівому куті.")
    elif x > 0 and y < 0:
        print("Точка розташована в нижньому правому куті.")
    elif x == 0 and y != 0:
        print("Точка лежить на осі OY.")
    elif x != 0 and y == 0:
        print("Точка лежить на осі OX.")
    else:
        print("Точка знаходиться у початку координат.")
        
x = int(input("Перша координата "))
y = int(input("Друга координата "))
main(x,y)